#include <stdio.h>
void main()
{
	int N, a, b, c, d, e, f, y, x;//N 用来存储需要的箱子数目,y 用来存储 2*2 的空位数目
	//x 用来存储 1*1 的空位数目。
	int u[4]={0, 5, 3, 1};
	//数组 u 表示 3*3 的产品数目分别是 4 的倍数,4 的倍数+1, 4 的倍数+2, 4 的倍数+3
	////时,为 3*3 的产品打开的新箱子中剩余的 2*2 的空位的个数

	while(1)
	{
		scanf("%d%d%d%d%d%d", &a, &b, &c, &d, &e, &f);
		if (a == 0 && b == 0 && c == 0 && d == 0 && e == 0 && f == 0) 
			break;

		N = f + e + d + (c + 3) / 4;
		//这里有一个小技巧 - (c+3)/4 正好等于 c 除以 4 向上取整的结果,下同
		y = 5 * d + u[c % 4];
		if (b > y) N += (b - y + 8 ) / 9;
		x = 36 * N - 36 * f - 25 * e - 16 * d - 9 * c - 4 * b;
		if(a > x) N += ( a - x + 35 ) / 36;
		printf("%d\n", N);
	} 
}

